{
  "name": "Or Brener",
  "label": "Software Engineer",
  "image_path": "img/profile.png",
  "contact": {
    "email": "or.brener@gmail.com",
    "phone": "647-888-2490",
    "location": "Toronto, Ontario, Canada"
  },
  "summary": "Full Stack Software Developer and Business Systems Analyst with a diverse skill set in backend development, cloud integration, and team collaboration.",
  "base_url": "https://orbrener.github.io/",
  "social_links": [
    {
      "label": "Personal Website",
      "url": "https://orbrener.github.io/",
      "svg_path": "img/globe.svg"
    },
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/orbrener",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "Github",
      "url": "https://github.com/OrBrener",
      "svg_path": "img/github.svg"
    }
  ],
  "work_experience": [
    {
      "company": "ecobee",
      "position": "Integrations Developer (co-op)",
      "url": "https://www.ecobee.com/en-ca/about/",
      "start_date": "01/2024",
      "end_date": "08/2024",
      "summary": "Built and optimized cloud-based integrations across ecobee's platform, improving service reliability, deployment scalability, and cross-system data accuracy through GCP and Docker-based solutions.",
      "highlights": [
        "Engineered scalable GCP Cloud Tasks Client and message router to coordinate inter-service communication, reducing processing time by 30% and significantly improving uptime across core integrations.",
        "Optimized the Shopify-Salesforce integration by rerouting data flow through GCP, cutting sync issues by 30% and improving data accuracy across 5+ interconnected systems.",
        "Migrated legacy GCP cloud functions into containerized Docker services, simplifying deployment pipelines and improving integration scalability and resilience in production environments."
      ]
    },
    {
      "company": "TD Bank",
      "position": "Business Systems Analyst (co-op)",
      "url": "https://www.td.com/ca/en/about-td",
      "start_date": "05/2023",
      "end_date": "08/2023",
      "summary": "Modernized internal data tools and processes across TD's global infrastructure by migrating dashboards, automating device lookup systems, and enhancing team efficiency with scalable Power BI and ServiceNow integrations.",
      "highlights": [
        "Spearheaded the migration of 10+ analytics dashboards from Tableau to Power BI, cutting load times by 60% and significantly improving reporting access for internal teams.",
        "Built and integrated a custom ServiceNow API into TD's device lookup tool, automating hardware queries and reducing manual request volume by 40% across five departments.",
        "Partnered with the Network Infrastructure team to evaluate device performance in 30+ global offices, standardizing workflows and boosting support response reliability."
      ]
    },
    {
      "company": "York Digital (TELUS Team)",
      "position": "Software Developer (co-op)",
      "url": "https://www.yorkdigital.ca/about-us",
      "start_date": "05/2022",
      "end_date": "12/2022",
      "summary": "Upgraded TELUS's billing platform by refactoring legacy C systems into Kotlin and GCP-integrated services, improving billing accuracy, reducing tech debt, and leading QA efforts to ensure stable deployments.",
      "highlights": [
        "Coordinated closely with business stakeholders and senior engineers to design and deliver accurate, production-grade billing data flows. Delivered reliable, well-documented billing feeds, improving data accuracy and reporting efficiency.",
        "Modernized TELUS' billing infrastructure by migrating legacy C-based components to Kotlin, delivering new GCP-integrated billing feeds and reducing technical debt by 30% while improving maintainability and system performance.",
        "Led QA testing and impact assessments for backend service changes, helping ensure system stability and significantly reducing bugs in post-release environments."
      ]
    },
    {
      "company": "365 Scores",
      "position": "Web Developer & QA",
      "url": "https://www.365scores.com/pages/about",
      "start_date": "06/2019",
      "end_date": "08/20202",
      "summary": "Expanded product access for millions of users by migrating mobile features to the web, while executing robust QA testing and collaborating with international teams to deliver high-quality feature rollouts.",
      "highlights": [
        "Migrated key mobile features to the web platform, expanding access for over 2 million users and enhancing the product's cross-platform reach.",
        "Executed over 100 test cases across multiple testing levels, strengthening release reliability and reducing post-launch issues by 35%.",
        "Collaborated with global product teams to align new features with business goals, ensuring relevance across diverse markets."
      ]
    },
    {
      "company": "University of Guelph",
      "position": "Teaching Assistant",
      "url": "https://www.uoguelph.ca/computing/",
      "start_date": "09/2021",
      "end_date": "04/2025",
      "summary": "Assisted in the instruction of technical courses and built auto-grading systems to streamline evaluation, providing personalized support to over 400 students and driving academic success across multiple terms.",
      "highlights": [
        "Built custom auto-grading tools that reduced grading time by 90% and accelerated feedback for over 300 student submissions.",
        "Supported the delivery of 6+ technical courses, assisting 400+ students through labs, office hours, and one-on-one mentoring.",
        "Contributed to improved course satisfaction by providing consistent academic support and clear technical instruction across programming and theory-focused subjects."
      ]
    }
  ],
  "projects": [
  {
    "title": "E-Commerce Product Catalog & Cart",
    "summary": "Built a full-stack e-commerce system to support product browsing, real-time inventory tracking, and streamlined checkout.",
    "url": "",
    "highlights": [
      "Developed catalog and cart features using C#, ASP.NET MVC, and JavaScript, enabling real-time product availability and seamless user flow.",
      "Implemented dynamic Razor views and session-based cart logic, improving usability and minimizing order errors.",
      "Optimized database queries and UI responsiveness, resulting in faster load times and a more intuitive shopping experience."
    ],
    "images": []
  },
  {
    "title": "StreamSwipe Mobile App",
    "summary": "Designed a collaborative mobile app that helps groups choose movies through real-time interaction and swipe-based voting.",
    "url": "",
    "highlights": [
      "Built using Flutter and Supabase, with real-time sync and secure authentication via RESTful APIs.",
      "Engineered matchmaking logic and group state management to coordinate multi-user input and decision flow.",
      "Delivered a clean, responsive UI that boosted engagement and reduced decision fatigue in user testing."
    ],
    "images": []
  },
  {
    "title": "Python Chess AI (Variation)",
    "summary": "Created a custom chess variant with an AI opponent capable of making competitive decisions using advanced game algorithms.",
    "url": "https://github.com/OrBrener/ChezzAI",
    "highlights": [
      "Implemented Minimax with Alpha-Beta pruning in Python, enabling efficient move selection in a non-standard game structure.",
      "Tuned evaluation functions and heuristics through test matches against 100+ peer implementations.",
      "Demonstrated adaptability in AI logic and performance tuning for dynamic board conditions."
    ],
    "images": []
  },
  {
    "title": "3D Molecule Viewer (Full Stack Web App)",
    "summary": "Built a web-based tool for inputting, visualizing, and analyzing 3D molecular data.",
    "url": "https://orbrener.github.io/Molecule-Viewer/",
    "highlights": [
      "Integrated Python, C, PostgreSQL, and JavaScript to process chemical data and render interactive molecule structures.",
      "Designed AJAX-powered front-end interactions with real-time structure updates, improving research usability.",
      "Streamlined data input and display workflows, enabling fast molecule loading and inspection."
    ],
    "images": []
  },
  {
    "title": "CI/CD Containerization Research",
    "summary": "Explored the benefits and trade-offs of integrating containerization into CI/CD testing pipelines.",
    "url": "https://orbrener.github.io/assets/Research_Paper.pdf",
    "highlights": [
      "Used Docker and GitHub Actions to build an isolated, repeatable test environment for a sample software project.",
      "Analyzed results to compare build speed, test reliability, and infrastructure complexity across environments.",
      "Published findings in a technical research paper with practical recommendations for engineering teams."
    ],
    "images": []
  },
  {
    "title": "Text File Statistics Tool",
    "summary": "Upgraded a Pascal-based text analysis program by converting it to Ada and extending its functionality.",
    "url": "https://github.com/OrBrener/Text-Statistics-In-Pascal-Ada",
    "highlights": [
      "Translated core logic into Ada, refactored structure, and added output formatting for clearer readability.",
      "Enhanced functionality to compute richer statistics like word frequencies, sentence count, and average lengths.",
      "Demonstrated software modernization and attention to legacy system usability."
    ],
    "images": []
  }
]
,
  "volunteer_experience": [
    {
      "organization": "Society of Computing and Information Science",
      "position": "Vice President Internal",
      "url": "",
      "start_date": "",
      "end_date": "",
      "summary": "Supported student leadership initiatives and internal governance for the computing student body during the academic year.",
      "highlights": [
        "Coordinated internal operations and led student committees to support departmental initiatives and engagement.",
        "Collaborated with the College of Engineering and Physical Sciences Student Council through weekly meetings to advocate for computing students.",
        "Organized bi-weekly events and activities that fostered community, professional development, and peer collaboration."
      ]
    },
    {
      "organization": "Royal Canadian Air Cadets",
      "position": "Corporal",
      "url": "",
      "start_date": "",
      "end_date": "",
      "summary": "Advanced through a structured leadership and aviation program while contributing to community-focused initiatives.",
      "highlights": [
        "Participated in weekly lessons, monthly field training exercises, and community service activities with a focus on leadership, discipline, and aviation fundamentals.",
        "Promoted to Corporal for consistent leadership and excellence; awarded Best New Recruit during first year.",
        "Represented squadron values through mentorship, teamwork, and active civic involvement."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Guelph",
      "location": "Guelph Ontario Canada",
      "url": "https://www.uoguelph.ca/computing/",
      "degrees": [
        "Bachelor of Computing (Software Engineering)",
        "Co-op"
      ],
      "honors": [
        "Outstanding Student Award",
        "Dean's List"
      ],
      "gpa_cumulative": "3.7",
      "gpa_major": "3.8",
      "graduation_date": "05/2025"
    }
  ],
  "skills": [
    {
      "name": "C",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Python",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "JavaScript",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Node.js",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "AJAX",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "C#",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "ASP.NET",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "React",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Angular",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Kotlin",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Java",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "SQL",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Ada",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "Fortran",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "COBOL",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "Pascal",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "HTML5",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "CSS3",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "R",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "Bootstrap",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Flutter",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Dart",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "PostgreSQL",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Linux CLI/CMD",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "GitHub Actions",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Google Cloud Platform",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Gradle",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "Maven",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "npm",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Figma",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "Postman",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Docker",
      "proficiency": 100,
      "proficiency_label": "Advanced"
    },
    {
      "name": "Google App Script",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "ServiceNow",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "Salesforce",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    },
    {
      "name": "NetSuite",
      "proficiency": 100,
      "proficiency_label": "Intermediate"
    }
  ],
  "interests": [
  {
    "name": "Piano",
    "summary": "Trained in classical piano through the Royal Conservatory Program, demonstrating discipline, creativity, and a long-term commitment to continuous learning.",
    "images": []
  },
  {
    "name": "Real Estate",
    "summary": "Self-educated in real estate investment and property management, applying analytical thinking and financial planning to real-world decision-making.",
    "images": []
  },
  {
    "name": "Culinary Arts",
    "summary": "Explore culinary techniques as a creative outlet that fosters precision, adaptability, and collaborative problem-solving under time constraints.",
    "images": []
  },
  {
    "name": "Automotive Enthusiast",
    "summary": "Pursue mechanical understanding and skilled driving as ways to strengthen technical curiosity, situational awareness, and problem-solving under pressure.",
    "images": []
  },
  {
    "name": "Chess",
    "summary": "Former competitive player with a focus on strategic reasoning, deep concentration, and adaptive decision-making across complex scenarios.",
    "images": []
  }
],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Russian",
      "fluency": "Conversational"
    },
    {
      "language": "Hebrew",
      "fluency": "Conversational"
    }
  ],
  "references": []
}